#### Тема “Вычисления с помощью Numpy” Задание 1.

In [28]:
import numpy as np
a = np.array([[1, 2, 3, 3, 1],
             [6, 8, 11, 10, 7]]).transpose()
    
mean_a = a.mean(axis = 0)
mean_a

array([2. , 8.4])

#### Тема “Вычисления с помощью Numpy” Задание 2.

In [2]:
a_centered = a - mean_a
a_centered

array([[-1. , -2.4],
       [ 0. , -0.4],
       [ 1. ,  2.6],
       [ 1. ,  1.6],
       [-1. , -1.4]])

#### Тема “Вычисления с помощью Numpy” Задание 3.

In [44]:
a_centered_sp = a_centered[:, 0] @ a_centered[:, 1]
a_centered_sp

8.0

In [46]:
a_centered_sp2 = a_centered_sp / (len(a_centered[:, 0]) - 1)
a_centered_sp2

2.0

#### Тема “Вычисления с помощью Numpy” Задание 4.

In [61]:
a_cov = np.cov(a.T)[0, 1]
a_cov

2.0

#### Тема “Работа с данными в Pandas” Задание 1.

In [3]:
import pandas as pd
authors = pd.DataFrame({'author_id': [1, 2, 3],
                        'author_name': ['Тургенев', 'Чехов', 'Островский']},
                       columns=['author_id', 'author_name'])
authors.set_index('author_id', inplace=True)
authors

          author_name
author_id
1            Тургенев
2               Чехов
3          Островский

In [4]:
book = pd.DataFrame({'author_id': [1, 1, 1, 2, 2, 3, 3],
                     'book_title': ['Отцы и дети', 
                                    'Рудин', 'Дворянское гнездо',
                                    'Толстый и тонкий', 'Дама с собачкой',
                                    'Гроза', 'Таланты и поклонники'],
                     'price': [450, 300, 350, 500, 450, 370, 290]},
                    columns=['author_id', 'book_title','price'])
book.set_index('author_id',  inplace=True)
book

                     book_title  price
author_id
1                   Отцы и дети    450
1                         Рудин    300
1             Дворянское гнездо    350
2              Толстый и тонкий    500
2               Дама с собачкой    450
3                         Гроза    370
3          Таланты и поклонники    290

#### Тема “Работа с данными в Pandas” Задание 2.

In [108]:
authors_price = pd.merge(authors, book, on='author_id', how='inner')
authors_price

          author_name            book_title  price
author_id
1            Тургенев           Отцы и дети    450
1            Тургенев                 Рудин    300
1            Тургенев     Дворянское гнездо    350
2               Чехов      Толстый и тонкий    500
2               Чехов       Дама с собачкой    450
3          Островский                 Гроза    370
3          Островский  Таланты и поклонники    290

#### Тема “Работа с данными в Pandas” Задание 3.

In [99]:
top5 = authors_price.nlargest(5, 'price').sort_values('author_name')
top5

          author_name         book_title  price
author_id
3          Островский              Гроза    370
1            Тургенев        Отцы и дети    450
1            Тургенев  Дворянское гнездо    350
2               Чехов   Толстый и тонкий    500
2               Чехов    Дама с собачкой    450

#### Тема “Работа с данными в Pandas” Задание 4.

In [100]:
my_groupby = authors_price.groupby("author_name")
authors_stat = pd.DataFrame({'min_price': my_groupby['price'].min(),
                             'max_price': my_groupby['price'].max(),
                             'mean_price': my_groupby['price'].mean()
                            })
authors_stat

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000

#### Тема “Работа с данными в Pandas” Задание 5.

In [101]:
cover = pd.DataFrame({'cover': ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']},
                    index=[1, 1, 1, 2, 2, 3, 3])
cover

     cover
1  твердая
1   мягкая
1   мягкая
2  твердая
2  твердая
3   мягкая
3   мягкая

In [109]:
authors_price2 = pd.concat([authors_price, cover], axis=1)
authors_price2

  author_name            book_title  price    cover
1    Тургенев           Отцы и дети    450  твердая
1    Тургенев                 Рудин    300   мягкая
1    Тургенев     Дворянское гнездо    350   мягкая
2       Чехов      Толстый и тонкий    500  твердая
2       Чехов       Дама с собачкой    450  твердая
3  Островский                 Гроза    370   мягкая
3  Островский  Таланты и поклонники    290   мягкая

In [111]:
authors_price3 = authors_price2.pivot_table(authors_price2, index=['author_name'], columns='cover', aggfunc = np.sum)
authors_price3
authors_price3['price'].fillna(0, inplace=True)
book_info = authors_price3.astype(np.int32)
book_info

             price
cover       мягкая твердая
author_name
Островский     660       0
Тургенев       650     450
Чехов            0     950

In [112]:
book_info.to_pickle("book_info.pkl")

In [113]:
book_info2 = pd.read_pickle("book_info.pkl")
book_info2

             price
cover       мягкая твердая
author_name
Островский     660       0
Тургенев       650     450
Чехов            0     950